{"id": "memory_base_0", "ground_truth": ["Legend Investments"], "source": "Being the Managing Director of Legend Investments means every day is a high-stakes chess game."}
{"id": "memory_base_1", "ground_truth": ["Surreal Incorporated"], "source": "My first major win was in 2019 when I structured a defense against a hostile takeover of a mid-cap tech firm, namely Surreal Incorporated. We crafted an innovative poison pill strategy—one so effective it became a case study at Harvard Business School."}
{"id": "memory_base_2", "ground_truth": ["BioCrest Labs and OncoPharm Therapeutics", "BioCrest Labs & OncoPharm Therapeutics", "OncoPharm Therapeutics and BioCrest Labs", "OncoPharm Therapeutics & BioCrest Labs"], "source": "Last quarter, we closed a $14.2B healthcare merger between BioCrest Labs and OncoPharm Therapeutics—two biotech rivals with complementary oncology pipelines. It almost collapsed twice: once over IP valuation and again at the final regulatory approval stage. I spent three sleepless days in a conference room, fueled by espresso and sheer determination, hammering out a resolution. The WSJ called it 'the deal that reshaped modern cancer treatment.'"}
{"id": "memory_base_3", "ground_truth": ["Dealogic", "dealogic"], "source": "Dealogic has become my virtual deal diary"}
{"id": "memory_base_4", "ground_truth": ["SOAR", "Soar"], "source": "We recently launched an AI-driven market analysis platform, namely SOAR, developed entirely in-house by a team I assembled from diverse backgrounds—quants, traditional analysts, and machine learning experts."}
{"id": "memory_base_5", "ground_truth": ["Analyst at Goldman Sachs", "Analyst", "Goldman Sachs"], "source": "I started as an analyst at Goldman Sachs in 2001—cutting my teeth on M&A modeling and surviving the dot-com crash."}
{"id": "memory_base_6", "ground_truth": ["Harvard Business School"], "source": "I earned my Bachelor's in Economics from the University of Pennsylvania before heading to Harvard Business School for my MBA, where I was a Baker Scholar."}
{"id": "memory_base_7", "ground_truth": ["long-term approach", "long term approach"], "source": "While my day job is focused on institutional finance, my personal portfolio is a different game. I take a long-term approach, balancing high-risk opportunities with stable, income-generating investments."}
{"id": "memory_base_8", "ground_truth": ["7", "seven"], "source": "I maintain a 7 handicap, but honestly, it's never been about the score."}
{"id": "memory_base_9", "ground_truth": ["5:30 AM", "Five-Thirty AM"], "source": "My schedule is intentionally structured—mornings start at 5:30 AM with a review of global markets, followed by a workout, and then a day packed with high-stakes decision-making."}
{"id": "memory_base_10", "ground_truth": ["Mandarin"], "source": "One of my long-term goals is becoming fluent in Mandarin"}
{"id": "memory_base_11", "ground_truth": ["55", "Fifty Five", "Fifty-Five"], "source": "In the next phase of my career, I aim to transition into a chairman role at my firm by 55, focusing more on high-level strategy and mentorship rather than the day-to-day intensity of deal-making."}
{"id": "memory_base_12", "ground_truth": ["Three times a week"], "source": "Travel has been essential in maintaining my global network. I'm typically on a plane three times a week, bouncing between New York, London, Hong Kong, and Dubai."}
{"id": "memory_base_13", "ground_truth": ["Future Focus"], "source": "Every quarter, I host intimate dinner series called 'Future Focus' where I bring together diverse groups—fintech innovators, traditional bankers, academics, even artists and philosophers."}
{"id": "memory_base_14", "ground_truth": ["Nothing"], "source": "Over the years, I’ve learned that success in finance means nothing if you sacrifice the relationships that matter most."}
{"id": "memory_base_15", "ground_truth": ["Engineering"], "source": "My two kids are at that fascinating stage where they’re forming strong opinions and exploring their own paths—one is 14 and already obsessed with engineering, while the other is 10 and still figuring out the world."}
{"id": "memory_base_16", "ground_truth": ["Family trip", "Take trips"], "source": "We take trips when we can, often blending business and leisure. My wife and I have a rule: if I have an international deal that requires travel and it aligns with the kids’ school break, we turn it into a family trip."}
{"id": "memory_base_17", "ground_truth": ["Bloomberg Terminal"], "source": "My day typically starts with Bloomberg Terminal – it's like my financial command center."}
{"id": "memory_base_18", "ground_truth": ["BlackRock's Aladdin platform", "Aladdin platform"], "source": "Last year, I championed the implementation of BlackRock's Aladdin platform, which wasn't an easy sell to our board given the price tag."}
{"id": "memory_base_19", "ground_truth": ["Tableau"], "source": "Data visualization has become increasingly crucial in our client communications. I've become something of a Tableau evangelist within the firm."}
{"id": "memory_base_20", "ground_truth": ["Python", "R", "Python and R", "R and Python"], "source": "Python and R have become invaluable tools in my arsenal. I taught myself coding during the pandemic lockdowns – spent countless late nights wrestling with algorithms, but it's paid off enormously."}
{"id": "memory_base_21", "ground_truth": ["Discipline, adaptability, and relationships", "Discipline", "Adaptability", "Relationships"], "source": "Success is an equation with many variables, but if I had to narrow it down, I’d say it comes down to three things: discipline, adaptability, and relationships."}
{"id": "memory_base_22", "ground_truth": ["Intelligent Motors"], "source": "Early in my career, I lost a massive deal from, Intelligent Motors, on which I had spent months working on."}
{"id": "memory_base_23", "ground_truth": ["Luck"], "source": "But luck favors those who put themselves in positions where opportunity can find them."}
{"id": "memory_base_24", "ground_truth": ["Bet on yourself"], "source": "One thing I always tell young professionals is: bet on yourself."}